<details>
      <summary>📋 Terraform Plan Output (Part 1/2)</summary>
      
      ```
      
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "leafwheels-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-alb"
          + "Project"     = "LeafWheels"
        }
      + tags_all                                                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-alb"
          + "Project"     = "LeafWheels"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication {
          + advertise_trust_store_ca_names   = (known after apply)
          + ignore_client_certificate_expiry = (known after apply)
          + mode                             = (known after apply)
          + trust_store_arn                  = (known after apply)
        }
    }

  # module.alb.aws_lb_listener_rule.actuator will be created
  + resource "aws_lb_listener_rule" "actuator" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 200
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/actuator/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_listener_rule.api will be created
  + resource "aws_lb_listener_rule" "api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {

          + path_pattern {
              + values = [
                  + "/api/*",
                ]
            }
        }
    }

  # module.alb.aws_lb_target_group.backend will be created
  + resource "aws_lb_target_group" "backend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "leafwheels-backend-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-tg"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-tg"
          + "Project"     = "LeafWheels"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.alb.aws_lb_target_group.frontend will be created
  + resource "aws_lb_target_group" "frontend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "leafwheels-frontend-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-tg"
          + "Project"     = "LeafWheels"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-tg"
          + "Project"     = "LeafWheels"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }

      + target_failover {
          + on_deregistration = (known after apply)
          + on_unhealthy      = (known after apply)
        }

      + target_group_health {
          + dns_failover {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }

          + unhealthy_state_routing {
              + minimum_healthy_targets_count      = (known after apply)
              + minimum_healthy_targets_percentage = (known after apply)
            }
        }

      + target_health_state {
          + enable_unhealthy_connection_termination = (known after apply)
          + unhealthy_draining_interval             = (known after apply)
        }
    }

  # module.ecr.aws_ecr_lifecycle_policy.backend will be created
  + resource "aws_ecr_lifecycle_policy" "backend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-backend"
    }

  # module.ecr.aws_ecr_lifecycle_policy.frontend will be created
  + resource "aws_ecr_lifecycle_policy" "frontend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber   = 10
                          + countType     = "imageCountMoreThan"
                          + tagPrefixList = [
                              + "v",
                            ]
                          + tagStatus     = "tagged"
                        }
                    },
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 day"
                      + rulePriority = 2
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-frontend"
    }

  # module.ecr.aws_ecr_repository.backend will be created
  + resource "aws_ecr_repository" "backend" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "leafwheels-backend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-ecr"
          + "Project"     = "LeafWheels"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-backend-ecr"
          + "Project"     = "LeafWheels"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.frontend will be created
  + resource "aws_ecr_repository" "frontend" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "leafwheels-frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-ecr"
          + "Project"     = "LeafWheels"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-frontend-ecr"
          + "Project"     = "LeafWheels"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository_policy.backend will be created
  + resource "aws_ecr_repository_policy" "backend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::635106762936:root"
                        }
                      + Sid       = "AllowPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-backend"
    }

  # module.ecr.aws_ecr_repository_policy.frontend will be created
  + resource "aws_ecr_repository_policy" "frontend" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::635106762936:root"
                        }
                      + Sid       = "AllowPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "leafwheels-frontend"
    }

  # module.ecs.aws_autoscaling_group.ecs will be created
  + resource "aws_autoscaling_group" "ecs" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "leafwheels-ecs-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution {
          + capacity_distribution_strategy = (known after apply)
        }

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_ids                 = (known after apply)
              + capacity_reservation_resource_group_arns = (known after apply)
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = (known after apply)
              + on_demand_percentage_above_base_capacity = (known after apply)
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
              + spot_max_price                           = (known after apply)
            }

          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }

              + override {
                  + instance_type     = (known after apply)
                  + weighted_capacity = (known after apply)

                  + instance_requirements {
                      + accelerator_manufacturers                               = (known after apply)
                      + accelerator_names                                       = (known after apply)
                      + accelerator_types                                       = (known after apply)
                      + allowed_instance_types                                  = (known after apply)
                      + bare_metal                                              = (known after apply)
                      + burstable_performance                                   = (known after apply)
                      + cpu_manufacturers                                       = (known after apply)
                      + excluded_instance_types                                 = (known after apply)
                      + instance_generations                                    = (known after apply)
                      + local_storage                                           = (known after apply)
                      + local_storage_types                                     = (known after apply)
                      + max_spot_price_as_percentage_of_optimal_on_demand_price = (known after apply)
                      + on_demand_max_price_percentage_over_lowest_price        = (known after apply)
                      + require_hibernate_support                               = (known after apply)
                      + spot_max_price_percentage_over_lowest_price             = (known after apply)

                      + accelerator_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + accelerator_total_memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + baseline_ebs_bandwidth_mbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_gib_per_vcpu {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + memory_mib {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_bandwidth_gbps {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + network_interface_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + total_local_storage_gb {
                          + max = (known after apply)
                          + min = (known after apply)
                        }

                      + vcpu_count {
                          + max = (known after apply)
                          + min = (known after apply)
                        }
                    }

                  + launch_template_specification {
                      + launch_template_id   = (known after apply)
                      + launch_template_name = (known after apply)
                      + version              = (known after apply)
                    }
                }
            }
        }

      + tag {
          + key                 = "AmazonECSManaged"
          + propagate_at_launch = false
          + value               = "true"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = false
          + value               = "prod"
        }
      + tag {
          + key                 = "ManagedBy"
          + propagate_at_launch = false
          + value               = "terraform"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = false
          + value               = "leafwheels-ecs-asg"
        }
      + tag {
          + key                 = "Project"
          + propagate_at_launch = false
          + value               = "LeafWheels"
        }

      + traffic_source {
          + identifier = (known after apply)
          + type       = (known after apply)
        }
    }

  # module.ecs.aws_ecs_capacity_provider.main will be created
  + resource "aws_ecs_capacity_provider" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "leafwheels-capacity-provider"
      + tags_all = (known after apply)

      + auto_scaling_group_provider {
          + auto_scaling_group_arn         = (known after apply)
          + managed_draining               = (known after apply)
          + managed_termination_protection = "DISABLED"

          + managed_scaling {
              + instance_warmup_period    = (known after apply)
              + maximum_scaling_step_size = 1
              + minimum_scaling_step_size = 1
              + status                    = "ENABLED"
              + target_capacity           = 100
            }
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "leafwheels-cluster"
      + tags     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cluster"
          + "Project"     = "LeafWheels"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cluster"
          + "Project"     = "LeafWheels"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.main will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "leafwheels-capacity-provider",
        ]
      + cluster_name       = "leafwheels-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "leafwheels-capacity-provider"
          + weight            = 100
        }
    }

  # module.ecs.aws_launch_template.ecs will be created
  + resource "aws_launch_template" "ecs" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0ac6dbd13e8c81d4f"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "leafwheels-ecs-"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKZWNobyBFQ1NfQ0xVU1RFUj1sZWFmd2hlZWxzLWNsdXN0ZXIgPj4gL2V0Yy9lY3MvZWNzLmNvbmZpZwplY2hvIEVDU19CQUNLRU5EX0hPU1Q9ID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKZWNobyBFQ1NfRU5BQkxFX1RBU0tfSUFNX1JPTEU9dHJ1ZSA+PiAvZXRjL2Vjcy9lY3MuY29uZmlnCmVjaG8gRUNTX0VOQUJMRV9UQVNLX0lBTV9ST0xFX05FVFdPUktfSE9TVD10cnVlID4+IC9ldGMvZWNzL2Vjcy5jb25maWcKCiMgSW5zdGFsbCBhZGRpdGlvbmFsIHBhY2thZ2VzCnl1bSB1cGRhdGUgLXkKeXVtIGluc3RhbGwgLXkgYXdzLWNsaQoKIyBDb25maWd1cmUgRG9ja2VyIGRhZW1vbgpjYXQgPiAvZXRjL2RvY2tlci9kYWVtb24uanNvbiA8PEVPRgp7CiAgImxvZy1kcml2ZXIiOiAiYXdzbG9ncyIsCiAgImxvZy1vcHRzIjogewogICAgImF3c2xvZ3MtZ3JvdXAiOiAiL2Vjcy9sZWFmd2hlZWxzLWNsdXN0ZXIiLAogICAgImF3c2xvZ3MtcmVnaW9uIjogInVzLWVhc3QtMSIsCiAgICAiYXdzbG9ncy1zdHJlYW0tcHJlZml4IjogImVjcyIKICB9Cn0KRU9GCgpzeXN0ZW1jdGwgcmVzdGFydCBkb2NrZXIKc3lzdGVtY3RsIHJlc3RhcnQgZWNz"
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + name = "leafwheels-ecs-instance-profile"
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Environment" = "prod"
              + "ManagedBy"   = "terraform"
              + "Name"        = "leafwheels-ecs-instance"
              + "Project"     = "LeafWheels"
            }
        }
    }

  # module.iam.aws_iam_instance_profile.ecs_instance will be created
  + resource "aws_iam_instance_profile" "ecs_instance" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "leafwheels-ecs-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "leafwheels-ecs-instance-role"
      + tags        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-instance-profile"
          + "Project"     = "LeafWheels"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-instance-profile"
          + "Project"     = "LeafWheels"
        }
      + unique_id   = (known after apply)
    }

  # module.iam.aws_iam_policy.cloudwatch_logs will be created
  + resource "aws_iam_policy" "cloudwatch_logs" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch Logs access from ECS tasks"
      + id               = (known after apply)
      + name             = "leafwheels-cloudwatch-logs-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cloudwatch-logs-policy"
          + "Project"     = "LeafWheels"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cloudwatch-logs-policy"
          + "Project"     = "LeafWheels"
        }
    }

  # module.iam.aws_iam_policy.ecr_access will be created
  + resource "aws_iam_policy" "ecr_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ECR access from ECS instances"
      + id               = (known after apply)
      + name             = "leafwheels-ecr-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecr-access-policy"
          + "Project"     = "LeafWheels"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecr-access-policy"
          + "Project"     = "LeafWheels"
        }
    }

  # module.iam.aws_iam_policy.lex_access will be created
  + resource "aws_iam_policy" "lex_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for AWS Lex access from ECS tasks"
      + id               = (known after apply)
      + name             = "leafwheels-lex-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lex:PostText",
                          + "lex:PostContent",
                          + "lex:GetBot",
                          + "lex:GetBotAlias",
                          + "lex:GetBotVersions",
                          + "lex:GetIntent",
                          + "lex:GetSlotType",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:lex:*:*:bot:leafwheels-chatbot:*",
                          + "arn:aws:lex:*:*:intent:*",
                          + "arn:aws:lex:*:*:slottype:*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-lex-access-policy"
          + "Project"     = "LeafWheels"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-lex-access-policy"
          + "Project"     = "LeafWheels"
        }
    }

  # module.iam.aws_iam_policy.s3_access will be created
  + resource "aws_iam_policy" "s3_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for S3 access from ECS tasks"
      + id               = (known after apply)
      + name             = "leafwheels-s3-access-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::leafwheels-images-*",
                          + "arn:aws:s3:::leafwheels-images-*/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-s3-access-policy"
          + "Project"     = "LeafWheels"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-s3-access-policy"
          + "Project"     = "LeafWheels"
        }
    }

  # module.iam.aws_iam_role.ecs_instance will be created
  + resource "aws_iam_role" "ecs_instance" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "leafwheels-ecs-instance-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-instance-role"
          + "Project"     = "LeafWheels"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-instance-role"
          + "Project"     = "LeafWheels"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "leafwheels-ecs-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-task-role"
          + "Project"     = "LeafWheels"
          + "Purpose"     = "ECSTask"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-task-role"
          + "Project"     = "LeafWheels"
          + "Purpose"     = "ECSTask"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role.ecs_task_execution will be created
  + resource "aws_iam_role" "ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "leafwheels-ecs-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-task-execution-role"
          + "Project"     = "LeafWheels"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-ecs-task-execution-role"
          + "Project"     = "LeafWheels"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_instance will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      + role       = "leafwheels-ecs-instance-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_instance_ecr will be created
  + resource "aws_iam_role_policy_attachment" "ecs_instance_ecr" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "leafwheels-ecs-instance-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "leafwheels-ecs-task-execution-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_execution_logs will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "leafwheels-ecs-task-execution-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_lex will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_lex" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "leafwheels-ecs-task-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ecs_task_s3 will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "leafwheels-ecs-task-role"
    }

  # module.s3.aws_cloudfront_distribution.images will be created
  + resource "aws_cloudfront_distribution" "images" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "CloudFront distribution for leafwheels images"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cloudfront"
          + "Project"     = "LeafWheels"
        }
      + tags_all                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-cloudfront"
          + "Project"     = "LeafWheels"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config {
              + enabled = (known after apply)
            }
        }

      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/vehicles/*"
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }

          + grpc_config {
              + enabled = (known after apply)
            }
        }
      + ordered_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + path_pattern           = "/accessories/*"
          + target_origin_id       = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }

          + grpc_config {
              + enabled = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = (known after apply)

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.s3.aws_cloudfront_origin_access_identity.images will be created
  + resource "aws_cloudfront_origin_access_identity" "images" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "OAI for leafwheels images bucket"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.s3.aws_s3_bucket.images will be created
  + resource "aws_s3_bucket" "images" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-images-bucket"
          + "Project"     = "LeafWheels"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "leafwheels-images-bucket"
          + "Project"     = "LeafWheels"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3.aws_s3_bucket_lifecycle_configuration.images will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "images" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "image_lifecycle"
          + status = "Enabled
      ```
      
      </details>